# GetColorOptions Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ColorOptions..::..GetColorOptions Method
ColorOptions Class See Also
---
Returns the current Revit instance's ColorOptions.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2020.1
# Syntax
C#
---
```text
public static ColorOptions GetColorOptions()
```

Visual Basic
---
```text
Public Shared Function GetColorOptions As ColorOptions
```

Visual C++
---
```text
public:
static ColorOptions^ GetColorOptions()
```

# ### Return Value
The ColorOptions for the current Revit instance.
# See Also
ColorOptions Class
Autodesk.Revit.DB Namespace